balazsgrill/modembed/res/Devices/dsPIC30/PIC24F32KA304.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG12" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG12" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG12" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG12" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG13" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG13" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG13" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG13" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG14" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG14" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG14" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG14" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnn-" edc:cname="WREG15" edc:desc="" edc:impl="0xfffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG15" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG15" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG15" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnr" edc:cname="SPLIM" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SPLIM" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPLIM" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="SPLIM" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:JoinedSFRDef edc:cname="PC" edc:desc="" edc:islanghidden="true" edc:name="PC" edc:nzwidth="0x18">
          <edc:SFRModeList/>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="PC"/>
          <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="PCL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PCL" edc:nzwidth="0x10" edc:por="0000000000000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PCL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PCL" edc:nzwidth="0x10"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---------rrrrrrr" edc:cname="PCH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0000000" edc:name="PCH" edc:nzlangwidth="0x8" edc:nzwidth="0x10" edc:por="---------0000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:islanghidden="true" edc:mask="0x7f" edc:name="PCH" edc:nzwidth="0x7"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="TBLPAG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="TBLPAG" edc:nzlangwidth="0x8" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TBLPAG" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TBLPAG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="PSVPAG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="PSVPAG" edc:nzlangwidth="0x8" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSVPAG" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PSVPAG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="RCOUNT" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="RCOUNT" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RCOUNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RCOUNT" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="10"/>
        <edc:SFRDef edc:access="-------nnnnrnnnn" edc:cname="SR" edc:desc="" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="SR" edc:nzwidth="0x10" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:desc="" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA" edc:desc="" edc:mask="0x1" edc:name="RA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IPL" edc:desc="" edc:mask="0x7" edc:name="IPL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="IPL0" edc:desc="" edc:mask="0x1" edc:name="IPL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPL1" edc:desc="" edc:mask="0x1" edc:name="IPL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPL2" edc:desc="" edc:mask="0x1" edc:name="IPL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------------cn--" edc:cname="CORCON" edc:desc="" edc:impl="0xc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00--" edc:name="CORCON" edc:nzwidth="0x10" edc:por="------------00--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PSV" edc:desc="" edc:mask="0x1" edc:name="PSV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IPL3" edc:desc="" edc:mask="0x1" edc:name="IPL3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:SFRDef edc:access="--nnnnnnnnnnnnnn" edc:cname="DISICNT" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuuuuuuuuuu" edc:name="DISICNT" edc:nzwidth="0x10" edc:por="--xxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DISICNT" edc:desc="" edc:islanghidden="true" edc:mask="0x3fff" edc:name="DISICNT" edc:nzwidth="0xe"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPD1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPD1" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN0PDE" edc:desc="" edc:mask="0x1" edc:name="CN0PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN1PDE" edc:desc="" edc:mask="0x1" edc:name="CN1PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN2PDE" edc:desc="" edc:mask="0x1" edc:name="CN2PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN3PDE" edc:desc="" edc:mask="0x1" edc:name="CN3PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN4PDE" edc:desc="" edc:mask="0x1" edc:name="CN4PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN5PDE" edc:desc="" edc:mask="0x1" edc:name="CN5PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN6PDE" edc:desc="" edc:mask="0x1" edc:name="CN6PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN7PDE" edc:desc="" edc:mask="0x1" edc:name="CN7PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN8PDE" edc:desc="" edc:mask="0x1" edc:name="CN8PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN9PDE" edc:desc="" edc:mask="0x1" edc:name="CN9PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN10PDE" edc:desc="" edc:mask="0x1" edc:name="CN10PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN11PDE" edc:desc="" edc:mask="0x1" edc:name="CN11PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN12PDE" edc:desc="" edc:mask="0x1" edc:name="CN12PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN13PDE" edc:desc="" edc:mask="0x1" edc:name="CN13PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN14PDE" edc:desc="" edc:mask="0x1" edc:name="CN14PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN15PDE" edc:desc="" edc:mask="0x1" edc:name="CN15PDE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
